//1) Сделать функцию которая при вызове напишет в консоль сумму 2-х переданных в неё чисел
function f1(p1,p2){
    let a1 = p1
    let a2 = p2
    result_text = "hello!"+p1+" "+p2
    console.log(result_text)
    return result_text
}

f1("Anna", 10)

//2) Сделать функцию которая вернёт в консоль квадрат переданного числа
//3) Сделать функцию. На вход принимет 3 параметра (Ф,И,О). Вернёт JSON
//{"name":И,
//"surname":Ф,
//"middlename":О}
//4) вывести в консоль переменную-массив в которой будут все чётные числа. Переменную возвращяет функция которая на вход принимает массив чисел.
//Если чётных чисел не нашлось, то функция вернёт текст "No even numbers"
//5) Сделать функцию которая вернёт количество букв 'a' в переданном в неё слове.
//Алфавит Eng. Если нету букв 'а', то вернтуть текст "No a characters".
//6) Написать функцию которая выдаст список тестов для переданного в неё web-ui элемента
//Элементы: Phone number field, CheckBox, SignIn Button.
//7) Написать функцию которая на вход получает JSON а возвращяет XML